zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dsi.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_dsi.h
  * @author  MCD Application Team
  * @brief   Header file of DSI HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_HAL_DSI_H
#define STM32MP2xx_HAL_DSI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_def.h"

#if defined(DSI)

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @defgroup DSI DSI
  * @brief DSI HAL module driver
  * @{
  */

/**
  * @brief HAL_DSI_DataRate enum definition
  */
typedef enum
{
  HAL_DSI_DT_80 = 0,
  HAL_DSI_DT_90,
  HAL_DSI_DT_100,
  HAL_DSI_DT_110,
  HAL_DSI_DT_120,
  HAL_DSI_DT_130,
  HAL_DSI_DT_140,
  HAL_DSI_DT_150,
  HAL_DSI_DT_160,
  HAL_DSI_DT_170,
  HAL_DSI_DT_180,
  HAL_DSI_DT_190,
  HAL_DSI_DT_205,
  HAL_DSI_DT_220,
  HAL_DSI_DT_235,
  HAL_DSI_DT_250,
  HAL_DSI_DT_275,
  HAL_DSI_DT_300,
  HAL_DSI_DT_325,
  HAL_DSI_DT_350,
  HAL_DSI_DT_400,
  HAL_DSI_DT_450,
  HAL_DSI_DT_500,
  HAL_DSI_DT_550,
  HAL_DSI_DT_600,
  HAL_DSI_DT_650,
  HAL_DSI_DT_700,
  HAL_DSI_DT_750,
  HAL_DSI_DT_800,
  HAL_DSI_DT_850,
  HAL_DSI_DT_900,
  HAL_DSI_DT_950,
  HAL_DSI_DT_1000,
  HAL_DSI_DT_1050,
  HAL_DSI_DT_1100,
  HAL_DSI_DT_1150,
  HAL_DSI_DT_1200,
  HAL_DSI_DT_1250,
  HAL_DSI_DT_1300,
  HAL_DSI_DT_1350,
  HAL_DSI_DT_1400,
  HAL_DSI_DT_1450,
  HAL_DSI_DT_1500,
  HAL_DSI_DT_1550,
  HAL_DSI_DT_1600,
  HAL_DSI_DT_1650,
  HAL_DSI_DT_1700,
  HAL_DSI_DT_1750,
  HAL_DSI_DT_1800,
  HAL_DSI_DT_1850,
  HAL_DSI_DT_1900,
  HAL_DSI_DT_1950,
  HAL_DSI_DT_2000,
  HAL_DSI_DT_2050,
  HAL_DSI_DT_2100,
  HAL_DSI_DT_2150,
  HAL_DSI_DT_2200,
  HAL_DSI_DT_2250,
  HAL_DSI_DT_2300,
  HAL_DSI_DT_2350,
  HAL_DSI_DT_2400,
  HAL_DSI_DT_2450,
  HAL_DSI_DT_2500,

} HAL_DSI_DataRate;

/* Exported types ------------------------------------------------------------*/
/** @defgroup DSI_Exported_Types DSI Exported Types
  * @{
  */
/**
  * @brief  DSI Init Structure definition
  */
typedef struct
{
  uint32_t AutomaticClockLaneControl;    /*!< Automatic clock lane control
                                              This parameter can be any value of @ref DSI_Automatic_Clk_Lane_Control */

  uint32_t TXEscapeCkdiv;                /*!< TX Escape clock division
                                              The values 0 and 1 stop the TX_ESC clock generation                    */

  uint32_t NumberOfLanes;                /*!< Number of lanes
                                              This parameter can be any value of @ref DSI_Number_Of_Lanes            */

  HAL_DSI_DataRate PhyDataRate;          /*!< PHY Data Rate
                                              This parameter can be any value of @ref HAL_DSI_DataRate           */

} DSI_InitTypeDef;

/**
  * @brief  DSI PLL Clock structure definition
  */
typedef struct
{
  uint32_t WrapPHYFrequency;        /*!< Wrapper PHY Frequency Range
                                         This parameter can be any value of @arg DSI_WRAP_PHY_PLL_Frequency   */

  uint32_t RefClkin;                /* PHY PLL Input Reference clock frequency (in KHz)
                                        This parameter must be in a range ( 17MHz to 27MHz )              */

  uint32_t PLLNDIV;                 /*!< PLL Loop Division Factor
                                         This parameter must be a value between 64 and 625                    */

  uint32_t PLLIDF;                  /*!< PLL Input Division Factor
                                         This parameter can be any value of @ref DSI_PLL_IDF                  */

  uint32_t PLLODF;                  /*!< PLL Output Division Factor
                                         This parameter can be any value of @ref DSI_PLL_ODF                  */

} DSI_PLLInitTypeDef;

/**
  * @brief  DSI Video mode configuration
  */
typedef struct
{
  uint32_t VirtualChannelID;             /*!< Virtual channel ID                                                 */

  uint32_t ColorCoding;                  /*!< Color coding for LTDC interface
                                              This parameter can be any value of @ref DSI_Color_Coding           */

  uint32_t LooselyPacked;                /*!< Enable or disable loosely packed stream (needed only when using
                                              18-bit configuration).
                                              This parameter can be any value of @ref DSI_LooselyPacked          */

  uint32_t Mode;                         /*!< Video mode type
                                              This parameter can be any value of @ref DSI_Video_Mode_Type        */

  uint32_t PacketSize;                   /*!< Video packet size                                                  */

  uint32_t NumberOfChunks;               /*!< Number of chunks                                                   */

  uint32_t NullPacketSize;               /*!< Null packet size                                                   */

  uint32_t HSPolarity;                   /*!< HSYNC pin polarity
                                              This parameter can be any value of @ref DSI_HSYNC_Polarity         */

  uint32_t VSPolarity;                   /*!< VSYNC pin polarity
                                              This parameter can be any value of @ref DSI_VSYNC_Active_Polarity  */

  uint32_t DEPolarity;                   /*!< Data Enable pin polarity
                                              This parameter can be any value of @ref DSI_DATA_ENABLE_Polarity   */

