zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dsi.h
/** @defgroup DSI_LP_LPDcsShortReadNoP DSI LP LPDcs Short Read NoP
  * @{
  */
#define DSI_LP_DSR0P_DISABLE     0x00000000U
#define DSI_LP_DSR0P_ENABLE      DSI_CMCR_DSR0TX
/**
  * @}
  */

/** @defgroup DSI_LP_LPDcsLongWrite DSI LP LPDcs Long Write
  * @{
  */
#define DSI_LP_DLW_DISABLE       0x00000000U
#define DSI_LP_DLW_ENABLE        DSI_CMCR_DLWTX
/**
  * @}
  */

/** @defgroup DSI_LP_LPMaxReadPacket DSI LP LPMax Read Packet
  * @{
  */
#define DSI_LP_MRDP_DISABLE      0x00000000U
#define DSI_LP_MRDP_ENABLE       DSI_CMCR_MRDPS
/**
  * @}
  */

/** @defgroup DSI_HS_PrespMode DSI HS Presp Mode
  * @{
  */
#define DSI_HS_PM_DISABLE        0x00000000U
#define DSI_HS_PM_ENABLE         DSI_TCCR3_PM
/**
  * @}
  */


/** @defgroup DSI_Automatic_Clk_Lane_Control DSI Automatic Clk Lane Control
  * @{
  */
#define DSI_AUTO_CLK_LANE_CTRL_DISABLE 0x00000000U
#define DSI_AUTO_CLK_LANE_CTRL_ENABLE  DSI_CLCR_ACR
/**
  * @}
  */

/** @defgroup DSI_Number_Of_Lanes DSI Number Of Lanes
  * @{
  */
#define DSI_ONE_DATA_LANE          0U
#define DSI_TWO_DATA_LANES         1U
#define DSI_THREE_DATA_LANES       2U
#define DSI_FOUR_DATA_LANES        3U
/**
  * @}
  */

/** @defgroup DSI_FlowControl DSI Flow Control
  * @{
  */
#define DSI_FLOW_CONTROL_CRC_RX    DSI_PCR_CRCRXE
#define DSI_FLOW_CONTROL_ECC_RX    DSI_PCR_ECCRXE
#define DSI_FLOW_CONTROL_BTA       DSI_PCR_BTAE
#define DSI_FLOW_CONTROL_EOTP_RX   DSI_PCR_ETRXE
#define DSI_FLOW_CONTROL_EOTP_TX   DSI_PCR_ETTXE
#define DSI_FLOW_CONTROL_ALL       (DSI_FLOW_CONTROL_CRC_RX | DSI_FLOW_CONTROL_ECC_RX  | \
                                    DSI_FLOW_CONTROL_BTA    | DSI_FLOW_CONTROL_EOTP_RX | \
                                    DSI_FLOW_CONTROL_EOTP_TX)
/**
  * @}
  */

/** @defgroup DSI_Color_Coding DSI Color Coding
  * @{
  */
#define DSI_RGB565                 0x00000000U /*!< The values 0x00000001 and 0x00000002 can also be used for the RGB565 color mode configuration */
#define DSI_RGB666                 0x00000003U /*!< The value 0x00000004 can also be used for the RGB666 color mode configuration                 */
#define DSI_RGB888                 0x00000005U
/**
  * @}
  */

/** @defgroup DSI_LooselyPacked DSI Loosely Packed
  * @{
  */
#define DSI_LOOSELY_PACKED_ENABLE  DSI_LCOLCR_LPE
#define DSI_LOOSELY_PACKED_DISABLE 0x00000000U
/**
  * @}
  */

/** @defgroup DSI_HSYNC_Polarity DSI HSYNC Polarity
  * @{
  */
#define DSI_HSYNC_ACTIVE_HIGH       0x00000000U
#define DSI_HSYNC_ACTIVE_LOW        DSI_LPCR_HSP
/**
  * @}
  */

/** @defgroup DSI_VSYNC_Active_Polarity DSI VSYNC Active Polarity
  * @{
  */
#define DSI_VSYNC_ACTIVE_HIGH       0x00000000U
#define DSI_VSYNC_ACTIVE_LOW        DSI_LPCR_VSP
/**
  * @}
  */

/** @defgroup DSI_DATA_ENABLE_Polarity DSI DATA ENABLE Polarity
  * @{
  */
#define DSI_DATA_ENABLE_ACTIVE_HIGH 0x00000000U
#define DSI_DATA_ENABLE_ACTIVE_LOW  DSI_LPCR_DEP
/**
  * @}
  */

/** @defgroup DSI_PLL_IDF DSI PLL IDF
  * @{
  */
#define DSI_PLL_IN_DIV1             0x00000000U
#define DSI_PLL_IN_DIV2             0x00000001U
#define DSI_PLL_IN_DIV3             0x00000002U
#define DSI_PLL_IN_DIV4             0x00000003U
#define DSI_PLL_IN_DIV5             0x00000004U
#define DSI_PLL_IN_DIV6             0x00000005U
#define DSI_PLL_IN_DIV7             0x00000006U
#define DSI_PLL_IN_DIV8             0x00000007U
#define DSI_PLL_IN_DIV9             0x00000008U
#define DSI_PLL_IN_DIV10            0x00000009U
#define DSI_PLL_IN_DIV11            0x0000000AU
#define DSI_PLL_IN_DIV12            0x0000000BU
#define DSI_PLL_IN_DIV13            0x0000000CU
#define DSI_PLL_IN_DIV14            0x0000000DU
#define DSI_PLL_IN_DIV15            0x0000000EU
#define DSI_PLL_IN_DIV16            0x0000000FU
/**
  * @}
  */

/** @defgroup DSI_PLL_ODF DSI PLL ODF
  * @{
  */
#define DSI_PLL_OUT_DIV1            0x00000000U
#define DSI_PLL_OUT_DIV2            0x00000001U
#define DSI_PLL_OUT_DIV4            0x00000002U
#define DSI_PLL_OUT_DIV8            0x00000003U
/**
  * @}
  */

/** @defgroup DSI_WRAP_PHY_PLL_Frequency DSI WRAP PHY PLL Frequency
  * @{
  */
#define DSI_WRAP_PHY_PLL_POS                  (0x8U)
#define DSI_WRAP_PHY_PLL_100MHZ_MASK          (0x20U << DSI_WRAP_PHY_PLL_POS)
#define DSI_WRAP_PHY_PLL_100MHZ               DSI_WRAP_PHY_PLL_100MHZ_MASK
#define DSI_WRAP_PHY_PLL_160MHZ_MASK          (0x02U << DSI_WRAP_PHY_PLL_POS)
#define DSI_WRAP_PHY_PLL_160MHZ               DSI_WRAP_PHY_PLL_160MHZ_MASK
#define DSI_WRAP_PHY_PLL_180MHZ_MASK          (0x22U << DSI_WRAP_PHY_PLL_POS)
#define DSI_WRAP_PHY_PLL_180MHZ               DSI_WRAP_PHY_PLL_180MHZ_MASK
#define DSI_WRAP_PHY_PLL_250MHZ_MASK          (0x33U << DSI_WRAP_PHY_PLL_POS)
#define DSI_WRAP_PHY_PLL_250MHZ               DSI_WRAP_PHY_PLL_250MHZ_MASK
#define DSI_WRAP_PHY_PLL_500MHZ_MASK          (0x26U << DSI_WRAP_PHY_PLL_POS)
#define DSI_WRAP_PHY_PLL_500MHZ               DSI_WRAP_PHY_PLL_500MHZ_MASK
#define DSI_WRAP_PHY_PLL_750MHZ_MASK          (0x39U << DSI_WRAP_PHY_PLL_POS)
#define DSI_WRAP_PHY_PLL_750MHZ               DSI_WRAP_PHY_PLL_750MHZ_MASK
#define DSI_WRAP_PHY_PLL_800MHZ_MASK          (0x09U << DSI_WRAP_PHY_PLL_POS)
#define DSI_WRAP_PHY_PLL_800MHZ               DSI_WRAP_PHY_PLL_800MHZ_MASK
#define DSI_WRAP_PHY_PLL_1000MHZ_MASK         (0x0AU << DSI_WRAP_PHY_PLL_POS)
#define DSI_WRAP_PHY_PLL_1000MHZ              DSI_WRAP_PHY_PLL_1000MHZ_MASK
/**
  * @}
  */


/** @defgroup DSI_Flags DSI Flags
  * @{
  */
#define DSI_FLAG_TE                 DSI_WISR_TEIF
#define DSI_FLAG_ER                 DSI_WISR_ERIF
#define DSI_FLAG_BUSY               DSI_WISR_BUSY
#define DSI_FLAG_PLLLS              DSI_WISR_PLLLS
#define DSI_FLAG_PLLL               DSI_WISR_PLLLIF
#define DSI_FLAG_PLLU               DSI_WISR_PLLUIF
#define DSI_FLAG_LAE                DSI_WISR_LAEIF
/**
  * @}
  */

/** @defgroup DSI_Interrupts DSI Interrupts
  * @{
  */
#define DSI_IT_TE                   DSI_WIER_TEIE
#define DSI_IT_ER                   DSI_WIER_ERIE
#define DSI_IT_PLLL                 DSI_WIER_PLLLIE
#define DSI_IT_PLLU                 DSI_WIER_PLLUIE
#define DSI_IT_LAE                  DSI_WIER_LAEIE
/**
  * @}
  */

/** @defgroup DSI_SHORT_WRITE_PKT_Data_Type DSI SHORT WRITE PKT Data Type
  * @{
  */
#define DSI_DCS_SHORT_PKT_WRITE_P0  0x00000005U /*!< DCS short write, no parameters      */
#define DSI_DCS_SHORT_PKT_WRITE_P1  0x00000015U /*!< DCS short write, one parameter      */
#define DSI_GEN_SHORT_PKT_WRITE_P0  0x00000003U /*!< Generic short write, no parameters  */
#define DSI_GEN_SHORT_PKT_WRITE_P1  0x00000013U /*!< Generic short write, one parameter  */
#define DSI_GEN_SHORT_PKT_WRITE_P2  0x00000023U /*!< Generic short write, two parameters */
/**
  * @}
  */

/** @defgroup DSI_LONG_WRITE_PKT_Data_Type DSI LONG WRITE PKT Data Type
  * @{
  */
#define DSI_DCS_LONG_PKT_WRITE      0x00000039U /*!< DCS long write     */
#define DSI_GEN_LONG_PKT_WRITE      0x00000029U /*!< Generic long write */
/**
  * @}
  */

